import Navbar from "./layouts/Navbar";

const data = [
  "हाम्रो पहिलो पाइला",
  `हामीले नयाँ यात्राको थालनी गरेका छौं– दायित्वबोध डटकमको नामबाट । प्रसिद्ध चिनियाँ दार्शनिक लाओ त्सेले भनेका छन्– हज्जारौं माइलको यात्राको शुरुवात पहिलो
  पाइलाबाट हुन्छ । यो पहिलो पाइला जीवन र जगतप्रतिको हाम्रो दायित्वको बोध गर्ने अभिलाषाबाट उत्प्रेरित छ । `,
  `हामी यो यात्राका क्रममा खबर–समाचारहरुमाथि तीखो नजर राख्ने छौं तर खबरका लागि खबर हाम्रो प्राथमिकता रहनेछैन । क्षणिक वाही वाही कमाउने लोभमा वा आफूलाई अग्र देखाउनका लागि 'ब्रेकिङ' गर्ने होडबाजीमा हामी हुँदैनौं । त्यस्तै, सनसनीपूर्ण खबरहरुका लागि पनि हामी अपहत्ते गर्ने छैनौं । बरु हाम्रो ध्येय र लक्ष्य खबरभित्रका खबरहरुको अन्तर्यलाई उधिन्ने र केलाउने रहनेछ ।`,
  `दायित्वबोधको मूल लक्ष्य नै समकालीन समाजमा देखापरेका आर्थिक, सामाजिक र राजनीतिका अस्पष्टतालाई छिरेर एउटा प्रष्ट र ताजा दृष्टिकोण निर्माण
  गर्ने हो । त्यसका लागि विचारमन्थन र अन्तक्र्रियाहरुको माध्यमबाट हामी अग्रगामी विचार निर्माणको दिशामा सार्थक पहल गर्नेछौं । `,
  `कोरा आदर्शका कुरा र उडन्ते गफ दुवै हाम्रा सामग्री हुने छैनन् । कुनै बाद, पक्ष वा दर्शनका आधारमा हामी भेदभाव वा छोइछिटो गर्ने छैनौं । हाम्रो एउटै शर्त रहनेछ– तपाईंका विचार अग्रगामी हुनुपर्छ, पश्चगामी सोचले लैस भएको चिन्तनलाई हामी स्थान दिने छैनौँ । यसर्थ समाजलाई अगाडि बढाउने खालका हरेक विचार, चिन्तन र दर्शनहरु हामीले समेट्ने सामग्री बन्ने छन् । जसको मन्थनबाट निस्कने निचोडमा नै समाज परिवर्तका लागि उत्तम विकल्पहरु, तिनलाई लागू गर्ने उपाय र विधिहरु समेटिएका हुन्छन् भन्ने हाम्रो विश्वास हो । `,
  `विश्वप्रसिद्ध दार्शनिक, वैज्ञानिक समाजवादी चिन्तनका प्रवर्तक कार्ल मार्क्सले भनेका छन्– दार्शनिकहरुले विभिन्न ढंगले विश्वलाई व्याख्या मात्र गरेका छन् । तर मुख्य कुरा, यसलाई कसरी परिवर्तन गर्ने भन्ने नै हो । हाम्रो कोशिस पनि विश्वलाई व्याख्या गर्ने कुराहरुको बहस–चिन्तनमा मात्रै केन्द्रीत रहेर रमाउने हुने छैन, त्यसलाई लागू
  गर्ने विधि र उपायहरुका बारेमा समेत मन्थन गर्ने हुनेछ । हाम्रो यो यात्रामा तपाई सबैको साथ, सहयोग, सुझाव र प्रतिक्रिया सदैब अपेक्षित र स्वीकार्य हुने विश्वास दिलाउन चाहन्छौं।`,
];

const HamroBare = () => {
  return (
    <div>
      <Navbar />
      <div className="flex justify-center w-full">
        <div className="flex flex-col pt-[1rem] w-full px-px  lg:justify-end lg:w-lg-p  xl:w-xl-p">
          <h3 className="text-[2rem] mb-[1rem]">हाम्रो बारे</h3>
          {data.map((para, index) => (
            <p className=" text-[1.5rem] font-[500] pb-[1rem]" key={index}>
              {para}
            </p>
          ))}
        </div>
      </div>
    </div>
  );
};

export default HamroBare;
