export const mukhya = [
  `महाकालेश्वरकाे भगवा वस्त्र:'क्रान्तिनायक'काे भयानक स्खलन !`,
  `भारतीय संसदकाे अखण्ड भारतकाे नक्सा: साँस्कृतिक माेह कि सुसुप्त  चाहनाकाे प्रकटीकरण`,
  `भारतीय संसदकाे अखण्ड भारतकाे नक्सा: साँस्कृतिक माेह कि सुसुप्त  चाहनाकाे प्रकटीकरण`,
  `भारतीय संसदकाे अखण्ड भारतकाे नक्सा: साँस्कृतिक माेह कि सुसुप्त  चाहनाकाे प्रकटीकरण`,
  `भारतीय संसदकाे अखण्ड भारतकाे नक्सा: साँस्कृतिक माेह कि सुसुप्त  चाहनाकाे प्रकटीकरण`,
];

export const baicharik = [
  `भविष्यमा हाम्रै आकाशगंगासँग ठाेक्किदैछ छिमेकी आकाशगंगा एन्ड्राेमेडा `,
  `पृथ्वीभन्दा ५ गुना ठुलाे नयाँ ग्रह हाम्राे साैर्यमण्डलमा ? `,
  `हावा हुरी किन चल्छ ? हावा हुरीले फाइदा पनि गर्छ र ?`,
  `हाम्रै आकाशगंगामा पृथ्वीजस्तै ग्रहरु खरबाैंकाे संख्यामा !`,
];
